{
    "about":{
        "title":"About me",
        "description": "I’m a third-year Computer Science student currently exploring different domains in tech.I’ve been learning web development, app development using Flutter, and working on AI and data-related projects with Python.I enjoy building projects that help me understand real-world applications, and I’m always open to trying new technologies and improving my skills."
    },
    "projects":{
        "1":{
            "title":"College Hub",
            "description":"College Hub is a full-stack academic management platform featuring secure authentication (with JWT and role-based access), real-time chat forums, and comprehensive systems for task assignment, student profiles, attendance, timetables, performance tracking, and digital notes. It streamlines operations for students, faculty, and administrators through an intuitive, centralized interface.",
            "tech":"Technologies used: React, Node.js, Express.js, MongoDB, JWT",
            "githubLink":"https://github.com/Aaje192/FullStack-Project-_-College-Hub"
        },
        "2":{
            "title":"Chain Reaction",
            "description":"Chain Reaction is a real-time multiplayer strategy game where players place orbs to trigger chain reactions and capture cells. The game features live online matches, built using React and Socket.io for smooth, interactive gameplay.",
            "tech":"Technologies used: React, Node.js, Express.js, Socket.io",
            "githubLink":"https://github.com/Lokesh-1511/chain-reaction",
            "liveLink":"https://chain-reaction-8bb4b.web.app/"
        },
        "3":{
            "title":"Legal Document Simplifier",
            "description":"An AI-powered web application that simplifies complex legal documents and answers user queries through an interactive chatbot. Users can upload PDFs to receive quick summaries or detailed explanations in plain language. Built with Python, Gradio, PyMuPDF, and LLaMA 3 (via Groq API), it ensures accurate, user-friendly legal understanding.",
            "tech":"Technologies used: Python",
            "githubLink":"https://github.com/Lokesh-1511/legal-doc-simplifier"
        },
        "4":{
            "title":"Smart Park",
            "description":"A cross-platform mobile app built with Flutter that enables users to find, book, and pay for parking spots in real-time. The app uses a custom-trained AI model with HSV-based image recognition to detect vacant and occupied parking slots from camera feeds.",
            "tech":"Technologies used: Flutter,Aws, Python",
            "githubLink":""
        }
    }
}